---
type: ExternalResourceServiceUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# ExternalResourceServiceUtils

`Autodesk.Revit.DB.ExternalResourceServiceUtils` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetServersByType | 2015 | `public static IList < IExternalResourceServer > GetServersByType ( ExternalResourceType type )` |